<script>
export default {
  data() {
    return {
         isAuth: true, 
    }
  },
  methods: {
    toggle: function () {
      this.isAuth = !this.isAuth;
    }
    
  }
}
</script>
<template>
   <button @click="toggle">Кнопка</button>
   <br><br>
  <div v-if="isAuth">
    <p>+++</p>
    <p>+++</p>
    <p>+++</p>
  </div>

  <p> ЗАДАНИЕ 2: Отличик в том, что v-show всегда присутствует в документе, а переключается только css стиль. Напротив v-if производит более глубокую отрисовку, проверяя каждый элемент, то есть уничтожение и создание элементов при изменении условия происходит чщательно. </p>
<br><br>
  <p> ЗАДАНИЕ 3: У v-if более высокие затраты на переключение, а у v-show более высокие начальные затраты на рендеринг. Так что лучше использовать v-show, если нужно что-то переключать очень часто, или использовать v-if, если условие вряд ли изменится во время выполнения.</p> <br>

<p> ЗАДАНИЕ 4: Директиву v-show нельзя использовать на элементе template и она не работает с v-else</p>
</template>